IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_adc_regs.xml
	<register id="ADCPPB3STAMP" width="16" page="1" offset="0x51" internal="0" description="ADC PPB3 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block 3 Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB3OFFCAL" width="16" page="1" offset="0x52" internal="0" description="ADC PPB3 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3OFFREF" width="16" page="1" offset="0x53" internal="0" description="ADC PPB3 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block 3 Offset Reference" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3TRIPHI" width="32" page="1" offset="0x54" internal="0" description="ADC PPB3 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block 3 Trip High Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3TRIPLO" width="32" page="1" offset="0x56" internal="0" description="ADC PPB3 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 3 Trip Low Limit" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="LIMITLO2EN" description="Extended Low Limit 2 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block 3 Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB4CONFIG" width="16" page="1" offset="0x58" internal="0" description="ADC PPB4 Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block 4 Configuration" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 4 Two's Complement Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CBCEN" description="Cycle By Cycle Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ABSEN" description="ADC Post Processing Block 4 Absolute Enable" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4STAMP" width="16" page="1" offset="0x59" internal="0" description="ADC PPB4 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block 4 Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB4OFFCAL" width="16" page="1" offset="0x5a" internal="0" description="ADC PPB4 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4OFFREF" width="16" page="1" offset="0x5b" internal="0" description="ADC PPB4 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block 4 Offset Reference" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4TRIPHI" width="32" page="1" offset="0x5c" internal="0" description="ADC PPB4 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block 4 Trip High Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4TRIPLO" width="32" page="1" offset="0x5e" internal="0" description="ADC PPB4 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 4 Trip Low Limit" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="LIMITLO2EN" description="Extended Low Limit 2 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block 4 Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCSAFECHECKRESEN" width="32" page="1" offset="0x60" internal="0" description="ADC Safe Check Result Enable Register">
		<bitfield id="SOC0CHKEN" description="ADC SOC0 Safety Checker Result Enable" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SOC1CHKEN" description="ADC SOC1 Safety Checker Result Enable" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SOC2CHKEN" description="ADC SOC2 Safety Checker Result Enable" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SOC3CHKEN" description="ADC SOC3 Safety Checker Result Enable" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="SOC4CHKEN" description="ADC SOC4 Safety Checker Result Enable" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SOC5CHKEN" description="ADC SOC5 Safety Checker Result Enable" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="SOC6CHKEN" description="ADC SOC6 Safety Checker Result Enable" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="SOC7CHKEN" description="ADC SOC7 Safety Checker Result Enable" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="SOC8CHKEN" description="ADC SOC8 Safety Checker Result Enable" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="SOC9CHKEN" description="ADC SOC9 Safety Checker Result Enable" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="SOC10CHKEN" description="ADC SOC10 Safety Checker Result Enable" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="SOC11CHKEN" description="ADC SOC11 Safety Checker Result Enable" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="SOC12CHKEN" description="ADC SOC12 Safety Checker Result Enable" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="SOC13CHKEN" description="ADC SOC13 Safety Checker Result Enable" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="SOC14CHKEN" description="ADC SOC14 Safety Checker Result Enable" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="SOC15CHKEN" description="ADC SOC15 Safety Checker Result Enable" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCINTCYCLE" width="16" page="1" offset="0x6f" internal="0" description="ADC Early Interrupt Generation Cycle">
		<bitfield id="DELAY" description="Delay from ADCSOC fall edge to early interrupt generation." begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM1" width="32" page="1" offset="0x70" internal="0" description="ADC Linearity Trim 1 Register">
		<bitfield id="INLTRIM31TO0" description="ADC Linearity Trim Bits 31-0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM2" width="32" page="1" offset="0x72" internal="0" description="ADC Linearity Trim 2 Register">
		<bitfield id="INLTRIM63TO32" description="ADC Linearity Trim Bits 63-32" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM3" width="32" page="1" offset="0x74" internal="0" description="ADC Linearity Trim 3 Register">
		<bitfield id="INLTRIM95TO64" description="ADC Linearity Trim Bits 95-64" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
