IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_adc_regs.xml
	<register id="ADCINLTRIM4" width="32" page="1" offset="0x76" internal="0" description="ADC Linearity Trim 4 Register">
		<bitfield id="INLTRIM127TO96" description="ADC Linearity Trim Bits 127-96" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM5" width="32" page="1" offset="0x78" internal="0" description="ADC Linearity Trim 5 Register">
		<bitfield id="INLTRIM159TO128" description="ADC Linearity Trim Bits 159-128" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM6" width="32" page="1" offset="0x7a" internal="0" description="ADC Linearity Trim 6 Register">
		<bitfield id="INLTRIM191TO160" description="ADC Linearity Trim Bits 191-160" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCREV2" width="16" page="1" offset="0x7d" internal="0" description="ADC Wrapper Revision Register">
		<bitfield id="WRAPPERTYPE" description="ADC Wrapper Type" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="WRAPPERREV" description="ADC Wrapper Revision" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="REP1CTL" width="32" page="1" offset="0x80" internal="0" description="ADC Trigger Repeater 1 Control Register">
		<bitfield id="MODE" description="ADC Trigger Repeater 1 Mode Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACTIVEMODE" description="ADC Trigger Repeater 1 Active Mode" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MODULEBUSY" description="ADC Trigger Repeater 1 Module Busy" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="PHASEOVF" description="ADC Trigger Repeater 1 Phase Delay Overflow" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGEROVF" description="ADC Trigger Repeater 1 Oversampled Trigger Overflow" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGER" description="ADC Trigger Repeater 1 Trigger Select" begin="14" end="8" width="7" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="ADC Trigger Repeater 1 Sync. In Select" begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="ADC Trigger Repeater 1 Software Sync." begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REP1N" width="32" page="1" offset="0x82" internal="0" description="ADC Trigger Repeater 1 N Select Register">
		<bitfield id="NSEL" description="ADC Trigger Repeater 1 Trigger Number Selection" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="NCOUNT" description="ADC Trigger Repeater 1 Trigger Counter" begin="22" end="16" width="7" rwaccess="R"/>
	</register>
	<register id="REP1PHASE" width="32" page="1" offset="0x84" internal="0" description="ADC Trigger Repeater 1 Phase Select Register">
		<bitfield id="PHASE" description="ADC Trigger Repeater 1 Phase Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="PHASECOUNT" description="ADC Trigger Repeater 1 Phase Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP1SPREAD" width="32" page="1" offset="0x86" internal="0" description="ADC Trigger Repeater 1 Spread Select Register">
		<bitfield id="SPREAD" description="ADC Trigger Repeater 1 Spread Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="SPREADCOUNT" description="ADC Trigger Repeater 1 Spread Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP1FRC" width="16" page="1" offset="0x88" internal="0" description="ADC Trigger Repeater 1 Software Force Register">
		<bitfield id="SWFRC" description="ADC Trigger Repeater 1 Software Force" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="REP2CTL" width="32" page="1" offset="0x90" internal="0" description="ADC Trigger Repeater 2 Control Register">
		<bitfield id="MODE" description="ADC Trigger Repeater 2 Mode Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACTIVEMODE" description="ADC Trigger Repeater 2 Active Mode" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MODULEBUSY" description="ADC Trigger Repeater 2 Module Busy" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="PHASEOVF" description="ADC Trigger Repeater 2 Phase Delay Overflow" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGEROVF" description="ADC Trigger Repeater 2 Oversampled Trigger Overflow" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGER" description="ADC Trigger Repeater 2 Trigger Select" begin="14" end="8" width="7" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="ADC Trigger Repeater 2 Sync. In Select" begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="ADC Trigger Repeater 2 Software Sync." begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REP2N" width="32" page="1" offset="0x92" internal="0" description="ADC Trigger Repeater 2 N Select Register">
		<bitfield id="NSEL" description="ADC Trigger Repeater 2 Trigger Number Selection" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="NCOUNT" description="ADC Trigger Repeater 2 Trigger Counter" begin="22" end="16" width="7" rwaccess="R"/>
	</register>
	<register id="REP2PHASE" width="32" page="1" offset="0x94" internal="0" description="ADC Trigger Repeater 2 Phase Select Register">
		<bitfield id="PHASE" description="ADC Trigger Repeater 2 Phase Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="PHASECOUNT" description="ADC Trigger Repeater 2 Phase Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP2SPREAD" width="32" page="1" offset="0x96" internal="0" description="ADC Trigger Repeater 2 Spread Select Register">
		<bitfield id="SPREAD" description="ADC Trigger Repeater 2 Spread Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="SPREADCOUNT" description="ADC Trigger Repeater 2 Spread Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
